EDT/УТ/src/Documents/ПередачаЗаказовНаВозврат_КУдалению/ПередачаЗаказовНаВозврат_КУдалению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПередачаЗаказовНаВозврат_КУдалению</name>
  <attributes>
    <name>ТерминалОбработки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказыНеПоМестам</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестСобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказыПоМестам</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>CatalogRef.МестаПоЗаказам</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Собрано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/ПозицииКВозврату/ПозицииКВозврату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПозицииКВозврату</name>
  <resources>
    <name>ПериодОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Магистраль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШтрихкодНоменклатуры_КУдалению</name>
    <type>
      <types>CatalogRef.ШтрихкодыТоваров</types>
    </type>
  </resources>
  <resources>
    <name>ВозвратОбработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТерминалПриема</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </resources>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вскрытый</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументИсточник</name>
    <type>
      <types>DocumentRef.ВозвратЗаказовОтВодителя</types>
      <types>String</types>
      <types>DocumentRef.ПередачаЗаказовНаВозврат_КУдалению</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихкодНоменклатурыИзмерение</name>
    <type>
      <types>CatalogRef.ШтрихкодыТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/ПередачаЗаказовНаВозврат_КУдалению/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	
	//   -----------------  РС ПозицииКВозврату  ----------------------
	
	Запрос = новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ПередачаЗаказовНаВозвратЗаказыНеПоМестам.Заказ КАК Заказ
	                      |ПОМЕСТИТЬ ВТ_Заказы
	                      |ИЗ
	                      |	Документ.ПередачаЗаказовНаВозврат.ЗаказыНеПоМестам КАК ПередачаЗаказовНаВозвратЗаказыНеПоМестам
	                      |ГДЕ
	                      |	ПередачаЗаказовНаВозвратЗаказыНеПоМестам.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ПередачаЗаказовНаВозвратЗаказыНеПоМестам.Заказ
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ПередачаЗаказовНаВозвратЗаказыПоМестам.Заказ
	                      |ИЗ
	                      |	Документ.ПередачаЗаказовНаВозврат.ЗаказыПоМестам КАК ПередачаЗаказовНаВозвратЗаказыПоМестам
	                      |ГДЕ
	                      |	ПередачаЗаказовНаВозвратЗаказыПоМестам.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ПередачаЗаказовНаВозвратЗаказыПоМестам.Заказ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Заказы.Заказ КАК Заказ,
	                      |	ВТ_Заказы.Заказ.ВладелецТовара КАК ИнтернетМагазин,
	                      |	ВТ_Заказы.Заказ.ТерминалПриема КАК ТерминалПриема,
	                      |	ВТ_Заказы.Заказ.КоличествоМест КАК КоличествоМест,
	                      |	ВЫБОР
	                      |		КОГДА ВТ_Заказы.Заказ.ТерминалПриема <> ВТ_Заказы.Заказ.ТерминалДоставки
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ КАК Магистраль,
	                      |	ВТ_Заказы.Заказ.ТерминалДоставки КАК ТерминалДоставки
	                      |ИЗ
	                      |	ВТ_Заказы КАК ВТ_Заказы");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезТЗ = Запрос.Выполнить().Выгрузить();
	
	Если РезТЗ.Количество() Тогда
	
		Набор = РегистрыСведений.ПозицииКВозврату.СоздатьНаборЗаписей();	
	    Набор.Отбор.ДокументИсточник.Установить(Ссылка);	
	    Набор.Прочитать();
		Набор.Очистить();
		
		Для каждого Стр Из РезТЗ Цикл
			
			НЗапись = Набор.Добавить();		
			ЗаполнитьЗначенияСвойств(НЗапись, Стр);		
			НЗапись.ДокументИсточник = Ссылка;
			НЗапись.Вскрытый = Ложь;
			НЗапись.ПериодОбработки = Дата;		
					
			//Набор.Отбор.Заказ.Установить(Стр.Заказ);
			//Набор.Прочитать();
			
			//Если Набор.Количество() Тогда		
			//	// Что-то не так	
			//	Продолжить;
			//Иначе			
				//НЗапись = Набор.Добавить();			
				//ЗаполнитьЗначенияСвойств(НЗапись, Стр);		
				//НЗапись.ДокументИсточник = Ссылка;
				//НЗапись.Вскрытый = Ложь;
				//НЗапись.ПериодОбработки = Дата;			
			//КонецЕсли;
		КонецЦикла;
		
		Набор.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	
		// Проверки на полностью собранные заказы
		ТекстНеполностьюСобранные = "Присутствуют неполностью собранные заказы: ";
		ЕстьНеполностьюСобранные = Ложь;
		
		Для каждого Ст Из ЗаказыНеПоМестам Цикл		
			Если Ст.КоличествоМест <> Ст.МестСобрано Тогда
				ЕстьНеполностьюСобранные = Истина;	
				ТекстНеполностьюСобранные = ТекстНеполностьюСобранные + Символы.ПС + СокрЛП(Ст.Заказ.Номер);
				Отказ = Истина;
			КонецЕсли;		
		КонецЦикла;
		
		Для каждого Ст Из ЗаказыПоМестам Цикл		
			Если НЕ Ст.Собрано Тогда
				ЕстьНеполностьюСобранные = Истина;	
				ТекстНеполностьюСобранные = ТекстНеполностьюСобранные + Символы.ПС + СокрЛП(Ст.Заказ.Номер);
				Отказ = Истина;
			КонецЕсли;	
		КонецЦикла;
		
		Если Отказ И ЕстьНеполностьюСобранные Тогда	
			Сообщить(ТекстНеполностьюСобранные);		
		КонецЕсли;
		
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда	
		
		// РС ПозицииКВозврату - удаление записей по документу
		Набор = РегистрыСведений.ПозицииКВозврату.СоздатьНаборЗаписей();
		Набор.Отбор.ДокументИсточник.Установить(Ссылка);
		Набор.Прочитать();
		Набор.Очистить();
		Набор.Записать();
	
		//Сообщить("Запрещена отмена проведения");
		//Отказ = Истина;
		
	КонецЕсли;	
	
	
КонецПроцедуры
